/*********************************************************
*文件名:	main.c
*作  者:	sinomicon
*版  本:	V1.00
*日  期:	2019/08/08
**********************************************************/

#include "lib_cap2.h"
/*********************************************************
函数名:	CAP0_RD
描  述:	读取捕捉值
输入值: 无
输出值: 16位值
返回值: 无 
**********************************************************/
uint CAP2_RD(void)
{
    uint tmp_data;
    tmp_data = CAP2_DH;
    tmp_data = tmp_data<<8;
    tmp_data = tmp_data + CAP2_DL;
    return  tmp_data;
}
